[
  {
    "Id": 1,
    "title": "Apple Reports Strong Q4 Earnings Despite Economic Headwinds",
    "summary": "Apple Inc. exceeded analyst expectations with record-breaking iPhone sales and robust services revenue, showcasing resilience in challenging market conditions.",
    "content": "Apple Inc. delivered impressive fourth-quarter results, with revenue reaching $94.93 billion, surpassing Wall Street estimates of $94.58 billion. The tech giant's iPhone sales drove the majority of growth, while its services segment continued its upward trajectory. CEO Tim Cook highlighted the company's strong positioning despite global economic uncertainties, citing innovation in AI and sustainable technology as key growth drivers for the coming quarters.",
    "source": "Financial Times",
    "author": "Sarah Johnson",
    "publishedAt": "2024-01-15T14:30:00Z",
    "category": "earnings",
    "tags": ["AAPL", "earnings", "technology", "iPhone"],
    "relevantSymbols": ["AAPL"],
    "relevanceScore": 95,
    "isRead": false,
    "imageUrl": "https://images.unsplash.com/photo-1611974789855-9c2a0a7236a3?w=400&h=200&fit=crop",
    "url": "https://ft.com/apple-earnings-q4-2024"
  },
  {
    "Id": 2,
    "title": "Microsoft Azure Cloud Revenue Surges 35% as AI Adoption Accelerates",
    "summary": "Microsoft's cloud computing division posted exceptional growth driven by enterprise AI integration and expanding market share in the competitive cloud services sector.",
    "content": "Microsoft Corporation announced that its Azure cloud platform achieved 35% year-over-year revenue growth, significantly outpacing competitors. The surge is primarily attributed to increased enterprise adoption of AI-powered services and the integration of GPT-4 technologies across business applications. Microsoft's Intelligent Cloud segment generated $24.3 billion in revenue, with CEO Satya Nadella emphasizing the company's leadership in the AI transformation of enterprise computing.",
    "source": "Wall Street Journal",
    "author": "Michael Chen",
    "publishedAt": "2024-01-14T16:45:00Z",
    "category": "earnings",
    "tags": ["MSFT", "cloud", "AI", "enterprise"],
    "relevantSymbols": ["MSFT"],
    "relevanceScore": 92,
    "isRead": false,
    "imageUrl": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?w=400&h=200&fit=crop",
    "url": "https://wsj.com/microsoft-azure-growth-2024"
  },
  {
    "Id": 3,
    "title": "Federal Reserve Signals Potential Interest Rate Cuts in 2024",
    "summary": "The Federal Reserve indicates a shift in monetary policy stance, with potential rate reductions on the horizon as inflation shows signs of cooling.",
    "content": "Federal Reserve Chair Jerome Powell suggested that the central bank may consider interest rate cuts in the coming months, marking a significant shift from the aggressive tightening cycle of the past two years. The Fed's latest meeting minutes reveal growing confidence that inflation is returning to the 2% target without triggering a severe recession. This policy pivot could have substantial implications for equity markets, particularly benefiting growth stocks and interest-sensitive sectors.",
    "source": "Reuters",
    "author": "Emma Rodriguez",
    "publishedAt": "2024-01-13T10:15:00Z",
    "category": "monetary-policy",
    "tags": ["fed", "interest-rates", "monetary-policy", "inflation"],
    "relevantSymbols": ["VTI", "BND"],
    "relevanceScore": 88,
    "isRead": true,
    "imageUrl": "https://images.unsplash.com/photo-1611974789855-9c2a0a7236a3?w=400&h=200&fit=crop",
    "url": "https://reuters.com/fed-rate-cuts-2024"
  },
  {
    "Id": 4,
    "title": "NVIDIA's AI Chip Demand Continues to Soar Amid Supply Constraints",
    "summary": "NVIDIA faces unprecedented demand for its AI processing units while navigating supply chain challenges and geopolitical tensions affecting semiconductor exports.",
    "content": "NVIDIA Corporation continues to experience extraordinary demand for its AI chips, with order backlogs extending well into 2024. The company's H100 and A100 processors have become critical infrastructure for major tech companies developing AI applications. However, supply chain constraints and export restrictions to certain markets are creating delivery delays. Despite these challenges, NVIDIA's data center revenue is projected to exceed $60 billion annually, solidifying its position as the leader in AI hardware acceleration.",
    "source": "Bloomberg",
    "author": "David Kim",
    "publishedAt": "2024-01-12T13:20:00Z",
    "category": "technology",
    "tags": ["NVDA", "AI", "semiconductors", "supply-chain"],
    "relevantSymbols": ["NVDA"],
    "relevanceScore": 94,
    "isRead": false,
    "imageUrl": "https://images.unsplash.com/photo-1518709268805-4e9042af2176?w=400&h=200&fit=crop",
    "url": "https://bloomberg.com/nvidia-ai-chip-demand-2024"
  },
  {
    "Id": 5,
    "title": "Amazon Web Services Expands Global Infrastructure with New Data Centers",
    "summary": "AWS announces major infrastructure investments across three continents, strengthening its position in the competitive cloud computing market.",
    "content": "Amazon Web Services revealed plans to invest $15 billion in new data center facilities across Europe, Asia, and South America over the next 18 months. This expansion aims to reduce latency for enterprise customers and comply with evolving data sovereignty regulations. The move positions AWS to better compete with Microsoft Azure and Google Cloud in international markets, while supporting the growing demand for AI and machine learning workloads that require substantial computing resources.",
    "source": "TechCrunch",
    "author": "Lisa Wang",
    "publishedAt": "2024-01-11T09:30:00Z",
    "category": "technology",
    "tags": ["AMZN", "AWS", "cloud", "infrastructure"],
    "relevantSymbols": ["AMZN"],
    "relevanceScore": 87,
    "isRead": false,
    "imageUrl": "https://images.unsplash.com/photo-1451187580459-43490279c0fa?w=400&h=200&fit=crop",
    "url": "https://techcrunch.com/aws-global-expansion-2024"
  },
  {
    "Id": 6,
    "title": "Tesla's Model Y Becomes World's Best-Selling Car in 2023",
    "summary": "Tesla's Model Y electric SUV achieved a historic milestone by becoming the world's best-selling vehicle across all categories in 2023.",
    "content": "Tesla Inc.'s Model Y electric SUV has officially become the world's best-selling car in 2023, marking the first time an electric vehicle has claimed this title. Global sales reached 1.23 million units, surpassing traditional gasoline-powered vehicles like the Toyota Corolla. This achievement underscores the accelerating shift toward electric mobility and Tesla's dominant position in the EV market. The success comes despite increased competition from legacy automakers and new EV startups entering the market.",
    "source": "Automotive News",
    "author": "Robert Martinez",
    "publishedAt": "2024-01-10T11:45:00Z",
    "category": "automotive",
    "tags": ["TSLA", "electric-vehicles", "automotive", "sales"],
    "relevantSymbols": ["TSLA"],
    "relevanceScore": 90,
    "isRead": true,
    "imageUrl": "https://images.unsplash.com/photo-1560958089-b8a1929cea89?w=400&h=200&fit=crop",
    "url": "https://autonews.com/tesla-model-y-bestseller-2023"
  },
  {
    "Id": 7,
    "title": "Gold Prices Surge to Near-Record Highs Amid Economic Uncertainty",
    "summary": "Gold reaches its highest levels in months as investors seek safe-haven assets amid geopolitical tensions and inflation concerns.",
    "content": "Gold prices have surged to near-record highs, approaching $2,080 per ounce as investors increasingly turn to precious metals as a hedge against economic uncertainty. The rally has been fueled by persistent geopolitical tensions, concerns about inflation persistence, and uncertainty surrounding central bank policies. Analysts predict continued strength in gold prices, particularly if economic data suggests a prolonged period of monetary policy uncertainty. ETFs tracking gold have seen significant inflows from institutional investors.",
    "source": "MarketWatch",
    "author": "Jennifer Adams",
    "publishedAt": "2024-01-09T15:10:00Z",
    "category": "commodities",
    "tags": ["gold", "commodities", "safe-haven", "inflation"],
    "relevantSymbols": ["GLD"],
    "relevanceScore": 85,
    "isRead": false,
    "imageUrl": "https://images.unsplash.com/photo-1610375461246-83df859d849d?w=400&h=200&fit=crop",
    "url": "https://marketwatch.com/gold-prices-surge-2024"
  },
  {
    "Id": 8,
    "title": "Bond Market Rally Continues as Inflation Data Shows Cooling Trend",
    "summary": "Treasury bonds extend their rally as latest inflation data supports the Federal Reserve's narrative of declining price pressures.",
    "content": "The bond market continued its impressive rally following the release of December's Consumer Price Index data, which showed inflation cooling to 3.2% year-over-year, down from 3.7% in November. The 10-year Treasury yield dropped to 4.1%, its lowest level in three months, as investors increasingly bet on Federal Reserve rate cuts in 2024. Bond ETFs have attracted significant investor flows, with total bond market funds receiving $12 billion in new investments over the past month.",
    "source": "Bond Buyer",
    "author": "Thomas Lee",
    "publishedAt": "2024-01-08T12:25:00Z",
    "category": "fixed-income",
    "tags": ["bonds", "treasury", "inflation", "fixed-income"],
    "relevantSymbols": ["BND"],
    "relevanceScore": 83,
    "isRead": false,
    "imageUrl": "https://images.unsplash.com/photo-1559589688-ffd41fdb0d31?w=400&h=200&fit=crop",
    "url": "https://bondbuyer.com/treasury-rally-inflation-2024"
  },
  {
    "Id": 9,
    "title": "Alphabet's Google Cloud Gains Market Share in Enterprise AI Race",
    "summary": "Google Cloud Platform demonstrates strong growth in AI services, challenging AWS and Microsoft's dominance in enterprise cloud computing.",
    "content": "Alphabet Inc.'s Google Cloud division has gained significant traction in the enterprise AI market, with revenue growing 28% year-over-year to reach $8.03 billion in the fourth quarter. The growth is primarily driven by businesses adopting Google's AI and machine learning tools, including its Vertex AI platform and generative AI services. While still trailing AWS and Microsoft Azure in overall market share, Google Cloud's focus on AI-native solutions is helping it win enterprise clients looking to integrate advanced AI capabilities into their operations.",
    "source": "CNBC",
    "author": "Alex Thompson",
    "publishedAt": "2024-01-07T14:55:00Z",
    "category": "technology",
    "tags": ["GOOGL", "cloud", "AI", "enterprise"],
    "relevantSymbols": ["GOOGL"],
    "relevanceScore": 89,
    "isRead": false,
    "imageUrl": "https://images.unsplash.com/photo-1573804633927-bfcbcd909acd?w=400&h=200&fit=crop",
    "url": "https://cnbc.com/google-cloud-ai-growth-2024"
  },
  {
    "Id": 10,
    "title": "Market Outlook 2024: Analysts Predict Continued Tech Sector Leadership",
    "summary": "Wall Street analysts maintain optimistic outlook for technology stocks, citing AI adoption and digital transformation trends as key growth drivers.",
    "content": "Leading Wall Street analysts are maintaining their bullish stance on technology stocks heading into 2024, with many predicting continued outperformance for the sector. The consensus view points to artificial intelligence adoption, cloud computing growth, and ongoing digital transformation initiatives as primary catalysts. Analysts at major investment banks have raised price targets for key tech names, with the NASDAQ-100 expected to outperform broader market indices. However, they caution that valuations remain elevated and economic headwinds could create volatility.",
    "source": "Barron's",
    "author": "Maria Garcia",
    "publishedAt": "2024-01-06T08:40:00Z",
    "category": "market-outlook",
    "tags": ["technology", "market-outlook", "AI", "predictions"],
    "relevantSymbols": ["VTI", "AAPL", "MSFT", "GOOGL", "AMZN", "NVDA"],
    "relevanceScore": 91,
    "isRead": true,
    "imageUrl": "https://images.unsplash.com/photo-1611974789855-9c2a0a7236a3?w=400&h=200&fit=crop",
    "url": "https://barrons.com/tech-outlook-2024"
  }
]